//Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.

// Console.WriteLine("Введите трехзначное число: ");
// int num = Convert.ToInt32(Console.ReadLine());
// if (num >=100 && num <1000)
// {
// int mid = (num % 100 -num % 10) / 10;
//     Console.WriteLine($"Второй цифрой числа {num} является цифра {mid}");
// }
// else
//     Console.WriteLine("Это число не является трехзначным!");
