//Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.

Console.WriteLine("Input first number:");
int num1 = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Input second number:");
int num2 = Convert.ToInt32(Console.ReadLine());

if (num1 > num2)
{
    Console.WriteLine($"{num1} -> max namber, {num2} -> min namber");
}
else    
{    
    Console.WriteLine($"{num1} -> min namber, {num2} -> max namber");
}


//Задача 4: Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.
    


    